{"loss": "binary_crossentropy", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Sequential", "keras_version": "1.0.4", "config": [{"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_2", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 137825, "batch_input_shape": [null, 100], "W_regularizer": null, "dropout": 0.55, "output_dim": 100, "input_length": 100}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.5, "dropout_W": 0.5, "input_dim": 100, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 100, "forget_bias_init": "one", "input_length": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_2"}}], "sample_weight_mode": null}